[
    {
        "year":"1492",
        "event":"Španělská kolonizace",
        "detail":"V roce 1492 Kubu objevil Kryštof Kolumbus, který také prozkoumal pobřeží ostrova, který pojmenoval Juana. V roce 1511 se na východě ostrova v oblasti Baracoa usadila první španělská kolonie pod vedením Diega Velázqueze. Kuba zůstala španělskou kolonií po následujících 400 let (jako Generální kapitanát Kuba). Roku 1512 byl v oblasti dnešního města Yara Španěly umučen Hathuey, náčelník Taínů, který proti dobyvatelům vedl guerrilovou válku. Později byl prohlášen za národního hrdinu Kuby.",
        "url":"#link"
    },
    {
        "year":"1898",
        "event":"španělsko-americká válka",
        "detail":"V roce 1898 proběhla španělsko-americká válka, ve které Španělsko ztratilo vládu nad Kubou, Portorikem a Španělskou východní Indií. Krátké období byla Kuba pod správou USA. Nezávislá Kuba byla vyhlášena 20. května 1902. USA si jako podmínku stažení svých vojsk udržely v pronájmu vojenskou základnu Guantánamo a zátoku Bahía Honda na druhé straně ostrova. Té se však později vzdaly na oplátku za rozšíření základny v Guantánamu.",
        "url":"https://cs.wikipedia.org/wiki/%C5%A0pan%C4%9Blsko-americk%C3%A1_v%C3%A1lka"
    },
    {
        "year":"1933",
        "event":"Kubánská republika",
        "detail":"V roce 1933 se k moci dostal seržant Fulgencio Batista y Zaldívar, který v zemi zavedl nejdříve relativně otevřenou vládu. Kubu v různých podobách kontroloval v letech 1933–1944 a poté opět 1952–1959. V období své první vlády Batista prosadil řadu sociálně laděných zákonů a byl znám dobrou spoluprací s odbory. Za druhé světové války vyhlásil válku Japonsku, Německu a Itálii, válečných operací se však Kuba přímo neúčastnila. V roce 1943 uspořádal v zemi svobodné volby, ve kterých zvítězil nastávající prezident Ramón Grau. Batista následujících 8 let žil v USA, domácí politiky se však účastnil na dálku a byl dokonce zvolen senátorem „v nepřítomnosti“. Po návratu na Kubu v roce 1952 se rozhodl kandidovat na prezidenta. Před volbami však bylo jasné, že kandidující Batista skončí na slabém 3. místě. Batista se proto rozhodl jednat. Dne 10. března 1952 se zmocnil vlády v zemi vojenským pučem. Jeho následující vláda se již projevovala korupcí, policejní brutalitou, překaženými volbami v roce 1954 a zhoršující se ekonomickou situací. Havana se stala známým centrem gamblerů, prostituce a americké mafie.",
        "url":"#link"
    },
    {
        "year":"1953",
        "event":"Počátky revoluce",
        "detail":"V této atmosféře vznikaly v zemi nejrůznější hnutí směřující ke svržení režimu a požadující svobodné volby. Jedním z nich byla i skupina kolem jistého Fidela Castra, syna statkáře z východu Kuby a člena Ortodoxní strany. Tato skupina dne 26. července 1953 uskutečnila známý útok na kasárna Moncada. Castro byl po útoku zatčen, odsouzen a spolu s bratrem Raúlem a dalšími členy hnutí v roce 1953 uvězněn na Ostrově borovic (Isla de los Pinos, nyní ostrov mládeže Isla de la Juventud). Přestože útok byl neúspěšný, Fidela Castra, který se v té době marně snažil prosadit i jinde, zmedializoval. Později po něm Castro pojmenoval své Hnutí 26. července, základ budoucí nové Komunistické strany Kuby. Po hlasování v kubánském parlamentu o amnestii byli bratři Castrovi v roce 1956 propuštěni na svobodu. Po propuštění se Castro obával o svůj život, odcestoval proto do Mexika, kde sestavil a vycvičil jednotku, která se jednoho dne měla vylodit na Kubě. Přestože ke konci své vlády byl již Batista široce nenáviděným diktátorem, byla Kuba v období jeho vlády jednou z nejbohatších zemí Latinské Ameriky. Míra gramotnosti obyvatelstva dosahovala těsně před jeho pádem necelých 80 % a byla tedy vyšší než ve Španělsku té doby.",
        "url":"#link"
    },
    {
        "year":"1956",
        "event":"Kubánská revoluce",
        "detail":"2. prosince 1956 připlul do země Fidel Castro na známé jachtě Granma (babička) s cílem vyvolat revoluci proti režimu Fulgencia Batisty. Po vylodění na východě ostrova (Oriente) v zemi postupně vypukla tzv. Kubánská revoluce, která skončila o dva roky později v lednu 1959 vítězstvím revolucionářů. Fidel Castro vstoupil do Havany triumfálně 8. ledna 1959 s příslibem brzkých svobodných voleb. Ty se však již nikdy nekonaly. Castrovi nejbližší spolupracovníci Ernesto Guevara a jeho bratr Raúl Castro byli již tehdy přesvědčenými marxisty, přičemž Raúl byl členem levého křídla místní strany PSP, původní komunistické strany Kuby. Již v roce 1959 tak začaly první protesty proti vlivu komunismu na ostrově. Samotný Batista uprchl dne 31. 12. 1958 ze země.",
        "url":"https://cs.wikipedia.org/wiki/Kub%C3%A1nsk%C3%A1_revoluce"
    },
    {
        "year":"1961",
        "event":"Invaze v Zátoce sviní",
        "detail":"Invaze v zátoce Sviní byla neúspěšná operace kubánských exulantů, kteří v dubnu 1961 pod vedením CIA napadli jižní Kubu. Tuto akci financovala a podporovala americká administrativa a jejím cílem bylo svržení Fidela Castra. Operace proběhla necelé tři měsíce poté, co se John Fitzgerald Kennedy stal 35. americkým prezidentem. Kvůli podcenění příprav však skončila naprostou porážkou. Kubánské ozbrojené síly odhodlané bránit výdobytky revoluce, vycvičené a vybavené státy Východního bloku, rozdrtily invazní bojovníky do tří dnů. Navíc se Fidel Castro v následujících měsících ještě více přimkl k Sovětskému svazu. Důsledkem tohoto vylodění byla Karibská krize.",
        "url":"https://cs.wikipedia.org/wiki/Invaze_v_z%C3%A1toce_Svin%C3%AD"
    },
    {
        "year":"1962",
        "event":"Kubánská krize",
        "detail":"Karibská krize (též Kubánská krize) byla mezinárodní politická krize. Hrozilo, že přeroste v jaderný konflikt. Vypukla v roce 1962 v důsledku rozmístění sovětských raket středního doletu na Kubě, kterým SSSR odpověděl na umístění amerických raket v Turecku. V reakci na to vyhlásily Spojené státy americké blokádu Kuby, která měla zabránit dopravení dalších raket na toto území. To se podařilo, neboť sovětská plavidla se na hranici kontrolované zóny skutečně zastavila. Po dalších jednáních byly odstraněny i již instalované rakety, Spojené státy americké se zavázaly, že nenapadnou Kubu a že stáhnou svoje rakety středního doletu z Turecka (taktické jaderné pumy B61 tam zůstávají dodnes). Dalším významným důsledkem této krize bylo zavedení horké dálnopisné linky mezi Bílým domem a Kremlem v roce 1963.",
        "url":"https://cs.wikipedia.org/wiki/Karibsk%C3%A1_krize"
    },
    {
        "year":"1980",
        "event":"Exodus z přístavu Mariel",
        "detail":"Celkově špatná situace na Kubě se prudce zhoršila ekonomickou krizí na konci 70. let. Ta vyvolala zájem obyvatel země o „hlasování nohama“, když velká skupina obyvatel začala v dubnu 1980 masově žádat o politický azyl na peruánském velvyslanectví v Havaně. Situace postupně gradovala až počet žádostí dosahoval přibližně 10.000 Kubánců. Ti obývali veškeré volné prostory ambasády. Za této situace, nikoliv nepodobné exodu Němců v roce 1989 z Prahy, byl Fidel Castro nucen umožnit volný odjezd všem, kteří o něj budou mít zájem. Exodus skončil v říjnu 1980 poté, co ze země prostřednictvím přístavu Mariel uprchlo více než 125.000 obyvatel",
        "url":"https://cs.wikipedia.org/wiki/Exodus_z_Mariel"
    },
    {
        "year":"1989",
        "event":"Proces s generálem Ochoou",
        "detail":"Důležitou událostí v rámci vnitřní politiky režimu byl v roce 1989 soudní proces s generálem Arnaldem Ochoou a dalšími vysokými funkcionáři, kteří byli obviněni z pašování drog a korupce. V červenci 1989 byl Ochoa spolu se třemi dalšími obviněnými na základě rozhodnutí soudu zastřelen. Generál Ochoa byl přitom oblíbeným členem ústředního výboru komunistické strany s rostoucím vlivem. Podle světových historiků se nedá zcela vyloučit, že do obchodu s drogami byl z politických důvodů a s cílem zajišťování financí pro státní i vlastní rozpočet zapleten i sám kubánský prezident. Poprava tohoto vysokého důstojníka měla možná i zlikvidovat ambice populárního vojenského vůdce a zastrašit opozici ve velení kubánské armády.",
        "url":"https://cs.wikipedia.org/wiki/Kuba"
    }
]